In [2]:
import numpy as np
import pandas as pd

In [3]:
d = {'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]}

In [4]:
d

{'A': [1, 2, nan], 'B': [5, nan, nan], 'C': [1, 2, 3]}

In [5]:
df = pd.DataFrame(d)
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [6]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [7]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [10]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [11]:
df.dropna(axis=0)

     A    B  C
0  1.0  5.0  1

In [13]:
df.dropna(thresh=2) #remove row having 2 nan value

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [33]:
df.fillna(value="NANd")

      A    B  C
0     1  5.0  1
1     2  5.0  2
2  NANd  5.0  3

In [34]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [35]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  5.0  2
2  NaN  5.0  3

In [36]:
df['B'].fillna(value=df['B'].mean())

0    5.0
1    5.0
2    5.0
Name: B, dtype: float64

In [37]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  5.0  2
2  NaN  5.0  3

In [38]:
df.fillna(value=df.mean())

     A    B  C
0  1.0  5.0  1
1  2.0  5.0  2
2  1.5  5.0  3